title: Certutil Download or Decode
id: ae05-sigma-certutil
status: stable
level: high
description: Detects use of certutil for downloading files or decoding data
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: "\\certutil.exe"
        CommandLine|contains:
            - "-urlcache"
            - "-decode"
            - "-decodehex"
            - "/urlcache"
            - "/decode"
    condition: selection
tags:
    - attack.defense_evasion
    - attack.t1140
